app/views/email_confirmation/confirm_email.html.erb

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" IS NULL LIMIT 1
---
<% if @user.profile_type=="UserProfile" %>
<p>Hello <%= "#{@user.profile.firstname} #{@user.profile.lastname},"%></p>