app/controllers/users_controller.rb

UPDATE "users" SET "activated" = 't', "remember_cookie" = 'VLXz-HCSCkd9lnM-pjJzbg', "updated_at" = '2013-04-23 02:25:11.598951' WHERE "users"."id" = 10
---
  def activate
  	@user= current_user
  	if @user.activated == true
  		redirect_to user_profile_path(@user.profile)
   	elsif (params[:code] == @user.confirmation_code) && (@user.confirmation_sent_date >= DateTime.now - 2.weeks)
      if @user.update_attribute('activated', true)