app/controllers/user_profiles_controller.rb

SELECT "user_profiles".* FROM "user_profiles"
---
  def index
    @user_profile = UserProfile.all

INSERT INTO "user_profiles" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "birth_date", "city", "country", "created_at", "firstname", "full_address", "gender", "hobbies", "lastname", "self_info", "street", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("activated", "confirmation_code", "confirmation_sent_date", "created_at", "email", "password_digest", "profile_id", "profile_type", "remember_cookie", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user_profile = UserProfile.new(params[:user_profile])
    if @user_profile.save

UPDATE "user_profiles" SET "street" = 'gandgandkatu', "city" = 'Tampere', "country" = 'Finland', "hobbies" = 'I like testing and eating food', "updated_at" = '2013-04-18 18:58:21.323793' WHERE "user_profiles"."id" = 980190963
---
  def update
    if current_profile.update_attributes(params[:user_profile])

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = 980190963 LIMIT 1
---
    def find_user_profile
     @user_profile = UserProfile.find(params[:id])